[
    {
        "id": 6,
        "name": "Simple Shop",
        "path": "..\/goods\/simple-shop",
        "image": "..\/img\/simple-shop.png",
        "goods_folder": "",
        "tag": "Shop",
        "style": "Platform",
        "description": "\"Mahdi's Shop\" E-commerce Template: Launch your online store instantly with this premium, mobile-friendly template featuring a direct-to-WhatsApp ordering system. Ideal for startups and small businesses who need a quick, low-overhead way to sell. Features include a dynamic cart, theme switching, and elegant product display. Ready to plug in your products and start selling today!",
        "story": "The Ultimate WhatsApp-Powered E-commerce Solution for Small & Startup Businesses\r\nStop worrying about complex payment gateways and backend systems! This \"Mahdi's Shop\" template is a full, ready-to-deploy front-end solution designed for maximum simplicity, conversion, and minimal overhead. It's the perfect platform for businesses looking to sell quickly, affordably, and personally.\r\n\r\nKey Features & Benefits:\r\nDirect WhatsApp Ordering: The core feature is a seamless checkout process that generates a pre-filled, comprehensive order message (including customer name, address, and full product list\/total) and sends it directly to your WhatsApp number. This is perfect for high-trust sales and markets where mobile messaging is preferred.\r\n\r\nDynamic, Persistent Shopping Cart: Customers can add, remove, and update quantities, and the cart data persists even if they leave and return later (using local storage). The cart summary is always visible.\r\n\r\nElegant & Responsive Design: Built with a modern aesthetic (index.css), the template looks fantastic on all devices. It includes built-in Dark\/Light theme switching for a premium user experience.\r\n\r\nStructured for Growth (Maximum Clarity): While capable of handling hundreds of products, the template is optimized for clarity with a recommended structure of 4 main sections (e.g., Best Sellers, All Products, Special Editions) and up to 24 total products (6 per section). This maintains a focused, high-end feel.\r\n\r\nScalable Architecture: The clean code base (HTML, CSS, JS) can technically support unlimited sections and 200+ products for larger businesses, though a maximum of 14 sections is recommended for optimal navigation.\r\n\r\nZero Monthly Fees: No required subscriptions or platform fees—just host the files and start selling.\r\n\r\nFull Information Sections: Includes dedicated, easy-to-update About Us and Contact Us sections with direct email and call links.\r\n\r\nWhat You Get: A complete, beautifully styled e-commerce storefront ready for your product images and details. Simply update the product data attributes in the index.html file, plug in your WhatsApp number in checkout.js, and launch!"
    },
    {
        "id": 5,
        "name": "Simple Blog",
        "path": "..\/goods\/simple-blog",
        "image": "..\/img\/simple-blog.png",
        "goods_folder": "",
        "tag": "Blog",
        "style": "Platform",
        "description": "Mahdi’s Blog is a dynamic, mobile-responsive platform featuring a stunning Dark\/Futuristic Neon Theme with optional light mode and modern \"glass effect\" card designs. The content is managed by a lean, powerful, and entirely custom-built PHP CMS that offers complete control, efficient image handling, and automatic post slug generation. It's the perfect blend of unique, cutting-edge design and streamlined, bespoke administration.",
        "story": "\"Dive into Mahdi’s Blog, a showcase of personalized, cutting-edge web design. The blog immediately grabs attention with its primary Dark\/Futuristic Neon Theme, utilizing a striking Neon Cyan accent color and a subtle glow effect for a modern, sci-fi aesthetic. For maximum accessibility and user preference, the site also includes a one-click toggle for a clean Light Theme. Every element is built with modern user experience in mind, featuring full mobile responsiveness and dynamically loading posts to ensure fast performance. The posts are always presented in the most logical order, sorted from latest to oldest, ensuring readers see the newest content first.\"\r\n\r\nCustom CMS Description\r\n\"This platform is powered by a powerful, custom-engineered backend—the Post Maker - Absolute PHP CMS. Developed for ultimate control and simplicity, this tool streamlines the content creation workflow. Key features include:\r\n\r\nComplete Post Management (CRUD): Easily create, fully edit, update, and delete posts with a dedicated interface.\r\n\r\nIntelligent Slug Management: The CMS automatically generates and dynamically updates post URLs (slugs) based on the title. When a title changes, the CMS automatically renames the post's HTML file, its dedicated images folder, and updates all internal path references to maintain integrity.\r\n\r\nAdvanced Media Handling: Manage your visual content effortlessly with support for multiple image uploads, separate thumbnail selection and replacement, and the ability to delete individual images within a post.\r\n\r\nIntuitive Interface: The CMS is styled with a distinct Deep Charcoal Theme and Electric Green accents, providing a unique, focused, and distraction-free environment for content creation.\r\n\r\nForm Persistence: Utilize a reliable session-based form data system, ensuring your content inputs are preserved even after post submission or error handling.\""
    },
    {
        "id": 4,
        "name": "Chat Platform",
        "path": "..\/goods\/chat-platform",
        "image": "..\/img\/talk-platform.png",
        "goods_folder": "",
        "tag": "Chatting",
        "style": "Platform",
        "description": "ChitChat is a self-hosted web chat platform built on PHP that prioritizes security and simplicity. It stores chat data, user, and session information in JSON files and uses AES-256-CBC encryption with a required 32-character key to secure messages. The platform manages chats via unique 16-character hexadecimal IDs, updates the chat feed via one-second polling, and allows users a limited time (300 seconds) to edit or delete their own messages.",
        "story": "The \"ChitChat\" platform is a PHP-based, full-stack web application designed for creating secure, isolated chat environments.\r\n\r\nCore Technology and Data Handling:\r\n\r\nThe application uses PHP for server-side logic and leverages JavaScript, HTML, and a modern \"Violet\/Zinc\" CSS palette for the user interface.\r\n\r\nInstead of a database, the platform stores all persistent data—including user accounts, active sessions, and the actual chat messages—in dedicated JSON files within a specified data directory (e.g., users.json, sessions.json, chat.json).\r\n\r\nSecurity and Messaging:\r\n\r\nA key feature is its focus on message encryption. It mandates a 32-character secret key and uses the aes-256-cbc cipher to encrypt and decrypt all messages.\r\n\r\nThe system includes helper functions for secure data handling, UTC time stamping of messages, and robust handling of file operations.\r\n\r\nChat Operation and Features:\r\n\r\nThe main page handles the creation and access of chats, requiring a 16-character hexadecimal Chat ID to join or create a new room.\r\n\r\nThe chat interface achieves near real-time updates through a client-side JavaScript implementation that polls the server every 1000 milliseconds (one second) to load new messages.\r\n\r\nUsers are provided administrative controls for their messages, specifically the ability to edit or delete a message for a window of 300 seconds (5 minutes) after it has been sent.\r\n\r\nThe interface also includes features like user authentication, modal windows for editing, a \"New Message Indicator\" to notify users when new content arrives off-screen, and a responsive design optimized for various screen sizes."
    },
    {
        "id": 3,
        "name": "Backup System",
        "path": "..\/goods\/backup-system",
        "image": "..\/img\/backup-system.png",
        "goods_folder": "",
        "tag": "Backup",
        "style": "system",
        "description": "This system implements a simple, web-based backup and restore utility written entirely in PHP with embedded HTML, CSS, and JavaScript. It's designed to manage backups of a specific \"live data directory\" (LIVE_DATA_DIR) by creating timestamped copies inside a local \/data\/ directory, organized by year-month, day, and time (YYYY-MM\/DD\/HH-MM\/). Users can manually create backups, view the contents of any specific backup, restore an entire backup to the live directory, restore a single file, and delete backups at the month, day, or individual time level through a navigational sidebar and AJAX-driven main content area.",
        "story": "This system, serves as a complete, single-page application for managing file backups for a web project.\r\n\r\nCore PHP Backend (Functions)\r\nThe backend logic primarily focuses on file system operations and security checks:\r\n\r\nInitialization and Setup:\r\n\r\nIt sets the PHP session lifetime to 1800 seconds (ini_set('session.gc_maxlifetime', 1800)).\r\n\r\nIt defines LIVE_DATA_DIR using a placeholder ('yourpathhere') and sets $data_dir to .\/data\/.\r\n\r\nIt performs an initial automatic backup upon the very first load ($is_initial_load) if a session flag ($_SESSION['initial_backup_created']) is not set.\r\n\r\nBackup & Restore Functions:\r\n\r\ncreateBackup($data_dir): Generates a unique, nested directory path (\/data\/YYYY-MM\/DD\/HH-MM\/) and uses recursive_copy to copy all contents from LIVE_DATA_DIR into it.\r\n\r\nrestoreBackup($backupPath): Deletes all content within LIVE_DATA_DIR and then copies the entire selected backup directory into it.\r\n\r\nrestoreFile($backupFilePath, $backupRootPath): Copies a single file from the backup path to the corresponding relative path in LIVE_DATA_DIR, ensuring the target directory exists.\r\n\r\nUtility & Management Functions:\r\n\r\nrrmdir($dir): A recursive function to remove a directory and its contents (used for deletion and during the full restore process).\r\n\r\nrecursive_copy($src, $dst): Recursively copies a directory and its files.\r\n\r\ndeleteDirectory($dirPath): Deletes a specified backup directory (month, day, or time level) with a crucial security check to ensure the path to be deleted is inside the main \/data\/ directory and is not the \/data\/ directory itself.\r\n\r\ngetFileContent($backupFilePath): Reads and returns the content of a file from a backup, with a security check to ensure the file is within the \/data\/ directory.\r\n\r\ngetFullPathFromCleanParams(...): Translates clean URL parameters (like a backup slug) back into a secure, real file path for viewing or restoring.\r\n\r\nAJAX Endpoint: A section handles POST requests for all actions (manual_backup, restore, restore_file, delete_month, delete_day, delete_backup) and returns a JSON response indicating success\/error and whether a full page reload is required.\r\n\r\nFrontend (HTML, CSS, JavaScript)\r\nThe frontend is a single-page interface with a sidebar and main content area:\r\n\r\nHTML Structure: Uses a fixed sidebar for navigation (<div class=\"sidebar\">) and a dynamic area for content (<div id=\"main-content-area\">).\r\n\r\nBackup Navigator (Sidebar):\r\n\r\nDisplays backups grouped hierarchically by Month (YYYY-MM) and Day (DD).\r\n\r\nEach level (Month, Day, Time) has delete actions attached via dynamic forms.\r\n\r\nIndividual backup times (HH:MM) include links to View Contents and forms to Restore the entire backup.\r\n\r\nThe structure is built by traversing the \/data\/ directory with glob() and PHP loops ($groupedBackups).\r\n\r\nMain Content Area (renderMainContent()):\r\n\r\nHandles the display logic based on $_GET parameters (backup and file).\r\n\r\nDefault View: Shows information about the LIVE_DATA_DIR and the backup storage structure.\r\n\r\nBackup List View: If a backup slug is selected, it displays a list of all files in that backup (getBackupFiles()). Each file has a link to view it and a button to restore the single file.\r\n\r\nFile Viewer: If a file is selected, it displays the file's content inside a <pre> tag and includes a button to Restore This File Only.\r\n\r\nJavaScript:\r\n\r\nAJAX Content Loading (loadContent()): Uses fetch to load the main content dynamically, ensuring the application feels responsive without full page reloads for viewing different files or backups. It also updates the browser history (history.pushState) to allow back\/forward navigation.\r\n\r\nDynamic Form Submission (handleDynamicFormSubmit()): Intercepts form submissions for all actions (create, delete, restore) and handles them via AJAX, displaying a toast-notification for success or error messages.\r\n\r\nToggles and Navigation: Manages the collapsible nature of the sidebar groups (Month\/Day) and the handling of the dynamic links."
    },
    {
        "id": 2,
        "name": "Upload System",
        "path": "..\/goods\/upload-system",
        "image": "..\/img\/upload-system.png",
        "goods_folder": "",
        "tag": "Media-Mangament",
        "style": "system",
        "description": "The application is a self-hosted Media Hub and User Content Management System (CMS). It is structured around three main components: a public-facing User Portal that lists profiles, a password-protected Admin Panel for comprehensive system and user management (including setting a global storage limit), and secure, personalized User Spaces where individual users can upload, categorize, and manage their own media (images, videos, and audio) within a strictly enforced per-user storage quota.",
        "story": "This platform operates as a complete, web-based solution for organizing and managing user accounts and their media assets, utilizing PHP for its core logic and data persistence.\r\n\r\nThe Public User Portal: This is the application's main entry point. It loads user information from a central JSON data file and presents it in a visually appealing grid of \"author cards.\" Each card displays a user's name, ID, and profile picture, and functions as a direct link to their private media space. The portal is styled using Tailwind CSS and includes a client-side function for toggling between light and dark modes based on user preference.\r\n\r\nThe Administration Panel: This is the secure command center of the system, requiring a simple password for access. Administrators have full CRUD (Create, Read, Update, Delete) control over user accounts. This includes creating new users, editing their profiles, and safely deleting users and all their associated files and directories. The panel offers a high-level dashboard displaying system-wide metrics, such as the total number of users, current aggregate storage usage, and the overall system storage limit (e.g., 5 GB). Furthermore, the admin can inspect and manage any individual user's media collection directly, with the ability to delete specific files after viewing them.\r\n\r\nThe Personalized User Space (CMS): Each user has a dedicated, personalized content management area. The primary function here is media uploading and management. The system enforces a strict per-user storage limit (e.g., 250 MB), displaying warnings and blocking new uploads if the limit is reached or if the file exceeds the remaining capacity. Media is automatically categorized into sections for Images, Videos, and Audio. The interface includes advanced client-side tools for efficient collection management, featuring:\r\n\r\nSearch functionality to filter files by name.\r\n\r\nSorting options by name, size, or date modified.\r\n\r\nFiltering by upload date.\r\n\r\nBulk deletion of selected items.\r\n\r\nA full-screen modal for viewing media. All filenames are processed using Base64 encoding for robust and compatible storage."
    },
    {
        "id": 1,
        "name": "Login System",
        "path": "..\/goods\/login-system",
        "image": "..\/img\/login-system.png",
        "goods_folder": "",
        "tag": "Security",
        "style": "system",
        "description": "This is a PHP-based, file-driven Single Device Login System with security features like rate limiting (cool-down period) and page-level access control. User accounts, sessions, and logs are stored in four separate JSON files (accounts.json, sessions.json, logs.json, and full-logs.json). Upon a successful login, any existing session for that user is terminated, enforcing one active session per user. Passwords are stored securely as SHA-256 hashes (though the cleartext and Base64 versions are also stored in the logs\/accounts for administrative purposes). All login attempts are meticulously logged.",
        "story": "Detailed Breakdown of the Login System\r\nThe login system is primarily contained within the include.php file, which is designed to be included at the beginning of any protected page. This structure enforces authentication and authorization before rendering the main page content.\r\n\r\n1. Configuration and Data Storage\r\nThe system relies on four JSON files to store all persistent data:\r\n\r\naccounts.json: Stores user profiles, including user-name, user-password-sha256 (the secure hash), user-password-base64 (the Base64-encoded cleartext password), a list of user-premissions (paths the user can access), and the last-log timestamp.\r\n\r\nsessions.json: Stores active login sessions for single-device enforcement, containing the user-name, a unique session-cookie, and the session-expiration time.\r\n\r\nlogs.json and full-logs.json: Store detailed and simplified records of all login attempts.\r\n\r\n2. Login Process (process_login function in include.php)\r\nThe login process is executed upon a POST request containing a username and password:\r\n\r\nRate Limiting\/Cool-Down: Before authentication, the system checks the server-side $_SESSION['failed_attempts']. If the user has exceeded MAX_FAILED_ATTEMPTS (3) within COOL_DOWN_MINUTES (15), the login is immediately blocked, and the user is informed of the remaining cool-down time.\r\n\r\nAuthentication: The entered password is converted to a SHA-256 hash and compared against the stored hash in accounts.json.\r\n\r\nPage Permission Check: If authentication succeeds, the is_page_allowed function checks the user's permissions array against the current page's URI. It supports exact path matching and wildcard permissions (e.g., \/admin\/*).\r\n\r\nSingle Device Enforcement: If the user is successfully authenticated and authorized:\r\n\r\nAny existing session for that user in sessions.json is deleted. This effectively logs out the user on any other device.\r\n\r\nA new session record with a unique session-cookie and a 1-hour expiration is added to sessions.json.\r\n\r\nThe server-side $_SESSION is set with the user's login data.\r\n\r\nLogging: A successful-login event is logged to both logs.json and full-logs.json. For security, full-logs.json also captures the Base64-encoded client IP address and the full session cookie.\r\n\r\nFailed Attempts: If login fails (wrong credentials or access denied), the $_SESSION['failed_attempts'] counter is incremented, and a failed-login event is logged. The entered password is Base64-encoded before being logged in full-logs.json and logs.json.\r\n\r\n3. Session Validation and Authorization Check\r\nOn every page load, include.php performs a session check:\r\n\r\nServer-Side Check: It confirms the existence of the $_SESSION['is_logged_in'] flag.\r\n\r\nSession Cookie Validation: It searches sessions.json for a matching user-name and session-cookie. If a match is not found (due to expiration or being logged in elsewhere), the session is cleared, and an appropriate error is displayed.\r\n\r\nPage-Level Authorization: It re-checks the user's permissions for the current page (is_page_allowed).\r\n\r\nEnforcement: If the user is not valid, authorized, or their session is expired\/deleted, the script stops (exit()) and includes login.php to display the login form.\r\n\r\n4. Admin Panel (index.php)\r\nThe index.php file implements a basic Admin Panel for managing the login system's data.\r\n\r\nAdmin Authentication: The panel has a simple, non-hashed password login defined by the ADMIN_PASSWORD constant.\r\n\r\nCRUD Operations: It provides Create, Read, Update, and Delete (CRUD) functionality for accounts.json (render_accounts_crud):\r\n\r\nCreate: Adds a new user, automatically hashing the password with SHA-256.\r\n\r\nUpdate: Allows changing a user's permissions or setting a new password (which is then re-hashed).\r\n\r\nDelete: Removes a user account.\r\n\r\nSession Management: The render_sessions_crud allows an admin to manually end an active session by deleting its entry from sessions.json.\r\n\r\nLogging: The render_logs function displays the content of full-logs.json, separating successful and failed logins and showing all tracked data points, including IP addresses, usernames, and passwords (stored in the logs as Base64-encoded cleartext).\r\n\r\nDashboard: The render_dashboard provides metrics on total users, log events, active sessions, and a list of recent user activity."
    }
]
